cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
		<register>
			<name>SETVALID0</name>
			<description>Set ValidPending control bits for all DMA channels.</description>
			<addressOffset>0x068</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>SV0</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>SV1</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>SV2</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>SV3</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>SV4</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>SV5</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>SV6</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>SV7</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>SV8</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>SV9</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>SV10</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>SV11</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>SV12</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>SV13</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>SV14</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>SV15</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>SV16</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>SV17</name>
					<description>SETVALID control for DMA channel n. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the VALIDPENDING control bit for DMA channel n.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:18]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SETTRIG0</name>
			<description>Set Trigger control bits for all DMA channels.</description>
			<addressOffset>0x070</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>SETTRIG0</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>SETTRIG1</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>SETTRIG2</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>SETTRIG3</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>SETTRIG4</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>SETTRIG5</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>SETTRIG6</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>SETTRIG7</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>SETTRIG8</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>SETTRIG9</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>SETTRIG10</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>SETTRIG11</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>SETTRIG12</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>SETTRIG13</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>SETTRIG14</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>SETTRIG15</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>SETTRIG16</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>SETTRIG17</name>
					<description>Set Trigger control bit for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = sets the TRIG bit for DMA channel n.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:18]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>ABORT0</name>
			<description>Channel Abort control for all DMA channels.</description>
			<addressOffset>0x078</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>AORTCTRL0</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>AORTCTRL1</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>AORTCTRL2</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>AORTCTRL3</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>AORTCTRL4</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>AORTCTRL5</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>AORTCTRL6</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>AORTCTRL7</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>AORTCTRL8</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>AORTCTRL9</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>AORTCTRL10</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>AORTCTRL11</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>AORTCTRL12</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>AORTCTRL13</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>AORTCTRL14</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>AORTCTRL15</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>AORTCTRL16</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>AORTCTRL17</name>
					<description>Abort control for DMA channel 0. Bit n corresponds to DMA channel n. 0 = no effect. 1 = aborts DMA operations on channel n.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:18]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>18</dim>
			<dimIncrement>0x10</dimIncrement>
			<dimIndex>0-17</dimIndex>
			<name>CFG%s</name>
			<description>Configuration register for DMA channel 0.</description>
			<addressOffset>0x400</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>PERIPHREQEN</name>
					<description>Peripheral request Enable. If a DMA channel is used to perform a memory-to-memory move, any peripheral DMA request associated with that channel can be disabled to prevent any interaction between the peripheral and the DMA controller.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. Peripheral DMA requests are disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. Peripheral DMA requests are enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>HWTRIGEN</name>
					<description>Hardware Triggering Enable for this channel.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. Hardware triggering is not used.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. Use hardware triggering.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[3:2]</bitRange>

