cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
				</field>
				<field>
					<name>WIDTH</name>
					<description>Transfer width used for this DMA channel.</description>
					<bitRange>[9:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>8_BIT_TRANSFERS_ARE</name>
							<description>8-bit transfers are performed (8-bit source reads and destination writes).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>16_BIT_TRANSFERS_ARE</name>
							<description>16-bit transfers are performed (16-bit source reads and destination writes).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>32_BIT_TRANSFERS_ARE</name>
							<description>32-bit transfers are performed (32-bit source reads and destination writes).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved setting, do not use.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[11:10]</bitRange>

				</field>
				<field>
					<name>SRCINC</name>
					<description>Determines whether the source address is incremented for each DMA transfer.</description>
					<bitRange>[13:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_INCREMENT</name>
							<description>No increment. The source address is not incremented for each transfer. This is the usual case when the source is a peripheral device.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>1_X_WIDTH</name>
							<description>1 x width. The source address is incremented by the amount specified by Width for each transfer. This is the usual case when the source is memory.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_X_WIDTH</name>
							<description>2 x width. The source address is incremented by 2 times the amount specified by Width for each transfer.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>4_X_WIDTH</name>
							<description>4 x width. The source address is incremented by 4 times the amount specified by Width for each transfer.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DSTINC</name>
					<description>Determines whether the destination address is incremented for each DMA transfer.</description>
					<bitRange>[15:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_INCREMENT</name>
							<description>No increment. The destination address is not incremented for each transfer. This is the usual case when the destination is a peripheral device.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>1_X_WIDTH</name>
							<description>1 x width. The destination address is incremented by the amount specified by Width for each transfer. This is the usual case when the destination is memory.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_X_WIDTH</name>
							<description>2 x width. The destination address is incremented by 2 times the amount specified by Width for each transfer.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>4_X_WIDTH</name>
							<description>4 x width. The destination address is incremented by 4 times the amount specified by Width for each transfer.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>XFERCOUNT</name>
					<description>Total number of transfers to be performed, minus 1 encoded. The number of bytes transferred is: (XFERCOUNT + 1) x data width (as defined by the WIDTH field). 0x0 = a total of 1 transfer will be performed. 0x1 = a total of 2 transfers will be performed. ... 0x3FF = a total of 1,024 transfers will be performed.</description>
					<bitRange>[25:16]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:26]</bitRange>

				</field>
			</fields>
		</register>
	</registers>
		</peripheral>
		
		<peripheral>
	<name>USB</name>
	<description>USB device controller</description>
	<groupName>USB</groupName>
	<baseAddress>0x1C00C000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>USB_IRQ</name>
	<value>28</value>
	</interrupt>
	<interrupt>
	<name>USB_FIQ</name>
	<value>29</value>
	</interrupt>
			<interrupt>
				<name>USBWAKEUP</name>
				<value>30</value>
			</interrupt>
	<registers>
		<register>
			<name>DEVCMDSTAT</name>
			<description>USB Device Command/Status register</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000800</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DEV_ADDR</name>
					<description>USB device address. After bus reset, the address is reset to 0x00. If the enable bit is set, the device will respond on packets for function address DEV_ADDR. When receiving a SetAddress Control Request from the USB host, software must program the new address before completing the status phase of the SetAddress Control Request.</description>
					<bitRange>[6:0]</bitRange>

				</field>
				<field>
					<name>DEV_EN</name>
					<description>USB device enable. If this bit is set, the HW will start responding on packets for function address DEV_ADDR.</description>
					<bitRange>[7:7]</bitRange>

