cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
				</field>
				<field>
					<name>SETUP</name>
					<description>SETUP token received. If a SETUP token is received and acknowledged by the device, this bit is set. As long as this bit is set all received IN and OUT tokens will be NAKed by HW. SW must clear this bit by writing a one. If this bit is zero, HW will handle the tokens to the CTRL EP0 as indicated by the CTRL EP0 IN and OUT data information programmed by SW.</description>
					<bitRange>[8:8]</bitRange>

				</field>
				<field>
					<name>PLL_ON</name>
					<description>USB Clock/PLL control.</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>USB_NEEDCLK_FUNCTION</name>
							<description>USB_NeedClk functional</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USB_NEEDCLK_ALWAYS_1</name>
							<description>USB_NeedClk always 1. Clock will not be stopped in case of suspend.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[10:10]</bitRange>

				</field>
				<field>
					<name>LPM_SUP</name>
					<description>LPM Support.</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LPM_NOT_SUPPORTED</name>
							<description>LPM not supported.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LPM_SUPPORTED</name>
							<description>LPM supported.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTONNAK_AO</name>
					<description>Interrupt on NAK for interrupt and bulk OUT EP</description>
					<bitRange>[12:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ONLY_ACKNOWLEDGED_PA</name>
							<description>Only acknowledged packets generate an interrupt</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BOTH_ACKNOWLEDGED_AN</name>
							<description>Both acknowledged and NAKed packets generate interrupts.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTONNAK_AI</name>
					<description>Interrupt on NAK for interrupt and bulk IN EP</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ONLY_ACKNOWLEDGED_PA</name>
							<description>Only acknowledged packets generate an interrupt</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BOTH_ACKNOWLEDGED_AN</name>
							<description>Both acknowledged and NAKed packets generate interrupts.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTONNAK_CO</name>
					<description>Interrupt on NAK for control OUT EP</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ONLY_ACKNOWLEDGED_PA</name>
							<description>Only acknowledged packets generate an interrupt</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BOTH_ACKNOWLEDGED_AN</name>
							<description>Both acknowledged and NAKed packets generate interrupts.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTONNAK_CI</name>
					<description>Interrupt on NAK for control IN EP</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ONLY_ACKNOWLEDGED_PA</name>
							<description>Only acknowledged packets generate an interrupt</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BOTH_ACKNOWLEDGED_AN</name>
							<description>Both acknowledged and NAKed packets generate interrupts.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DCON</name>
					<description>Device status - connect.  The connect bit must be set by SW to indicate that the device must signal a connect. The pull-up resistor on USB_DP will be enabled when this bit is set and the VbusDebounced bit is one.</description>
					<bitRange>[16:16]</bitRange>

				</field>
				<field>
					<name>DSUS</name>
					<description>Device status - suspend.  The suspend bit indicates the current suspend state. It is set to 1 when the device hasn't seen any activity on its upstream port for more than 3 milliseconds. It is reset to 0 on any activity. When the device is suspended (Suspend bit DSUS = 1) and the software writes a 0 to it, the device will generate a remote wake-up. This will only happen when the device is connected (Connect bit = 1). When the device is not connected or not suspended, a writing a 0 has no effect. Writing a 1 never has an effect.</description>
					<bitRange>[17:17]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[18:18]</bitRange>

				</field>
				<field>
					<name>LPM_SUS</name>
					<description>Device status - LPM Suspend.  This bit represents the current LPM suspend state. It is set to 1 by HW when the device has acknowledged the LPM request from the USB host and the Token Retry Time of 10us has elapsed. When the device is in the LPM suspended state (LPM suspend bit = 1) and the software writes a zero to this bit, the device will generate a remote walk-up. Software can only write a zero to this bit when the LPM_REWP bit is set to 1. HW resets this bit when it receives a host initiated resume. HW only updates the LPM_SUS bit when the LPM_SUPP bit is equal to one.</description>
					<bitRange>[19:19]</bitRange>

