cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
				</field>
			</fields>
		</register>
		<register>
			<dim>6</dim>
			<dimIncrement>0x8</dimIncrement>
			<dimIndex>0-5</dimIndex>
			<name>OUT%s_SET</name>
			<description>SCT output 0 set register</description>
			<addressOffset>0x500</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SET</name>
					<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 9 = bit 9.</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>6</dim>
			<dimIncrement>0x8</dimIncrement>
			<dimIndex>0-5</dimIndex>
			<name>OUT%s_CLR</name>
			<description>SCT output 0 clear register</description>
			<addressOffset>0x504</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CLR</name>
					<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 9 = bit 9.</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
	</registers>
</peripheral>
		
		<peripheral derivedFrom="SCT2">
			<name>SCT3</name>
			<description>SCT3</description>
			<baseAddress>0x1C024000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SCT3</name>
				<value>19</value>
			</interrupt>
			
		</peripheral>


		
		
		<peripheral>
	<name>ADC0</name>
	<description>12-bit ADC controller ADC0/1 </description>
	<groupName>ADC</groupName>
	<baseAddress>0x40000000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>ADC0_SEQA</name>
	<value>31</value>
	</interrupt>
	<interrupt>
	<name>ADC0_SEQB</name>
	<value>32</value>
	</interrupt>
	<interrupt>
	<name>ADC0_THCMP</name>
	<value>33</value>
	</interrupt>
	<interrupt>
	<name>ADC0_OVR</name>
	<value>34</value>
	</interrupt>
	<registers>
		<register>
			<name>CTRL</name>
			<description>A/D Control Register. Contains the clock divide value, enable bits for each sequence and the A/D power-down bit.</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CLKDIV</name>
					<description>In synchronous mode only, the system clock is divided by this value plus one to produce the clock for the A/D converter, which should be less than or equal to 50 MHz (up to 100 MHz in 10-bit mode).  Typically, software should program the smallest value in this field that yields this maximum clock rate or slightly less, but in certain cases (such as a high-impedance analog source) a slower clock may be desirable. This field is ignored in the asynchronous operating mode.</description>
					<bitRange>[7:0]</bitRange>

				</field>
				<field>
					<name>ASYNMODE</name>
					<description>Select clock mode.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SYNCHRONOUS_MODE</name>
							<description>Synchronous mode.  The ADC clock is derived from the system clock based on the divide value selected in the CLKDIV field. The ADC clock will be started in a controlled fashion in response to a trigger to eliminate any uncertainty in the launching of an ADC conversion in response to any synchronous (on-chip) trigger. In Synchronous mode with the SYNCBYPASS bit set, sampling of the A/D input and start of conversion will initiate exactly 2 system clocks after the leading edge of a (synchronous) trigger pulse.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASYNCHRONOUS_MODE</name>
							<description>Asynchronous mode. The ADC clock is based on the output of the asynchronous ADC clock divider ADCASYNCCLKSEL in the SYSCON block.  The frequency of this clock is limited to 50 MHz max (100 MHz in 10-bit mode). In addition, the ADC clock must never be faster than 10x the system clock.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MODE10BIT</name>
					<description>Select 10-bit conversion. In 10-bit mode higher conversion rates of up to 100 MHz are supported. A/D resolution is reduced to ten bits, but the clock rate (set via the CLKDIV field) can be increased up to 100 MHz to achieve a conversion rate of up to four million samples per second. The two LSBs of the result data are forced to zero.</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. The 10-bit/high-conversion rate mode is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. The 10-bit/high-conversion rate is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>LPWRMODE</name>
					<description>Select low-power ADC mode. The analog circuitry is automatically powered-down when no conversions are taking place. When any (hardware or software) triggering event is detected, the analog circuitry is enabled. After the required start-up time, the requested conversion will be launched. Once the conversion completes, the analog-circuitry will again be powered-down provided no further conversions are pending. Using this mode can save an appreciable amount of current (approximately 2.5 mA) when conversions are required relatively infrequently. The penalty for using this mode is an approximately 15 ADC clock delay (30 clocks in 10-bit mode), based on the frequency specified in the CLKDIV field, from the time the trigger event occurs until sampling of the A/D input commences. This mode will NOT power-up the A/D if the ADC_ENA bit is low.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. The low-power ADC mode is disabled.  The analog circuitry remains activated even when no conversions are requested.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. The low-power ADC mode is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[29:11]</bitRange>
					
