cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
				</field>							
				<field>							
					<name>VRANGE</name>						
					<description>Reserved.</description>						
					<bitRange>[5:5]</bitRange>						
					<enumeratedValues>						
						<name>ENUM</name>						
						<enumeratedValue>					
							<name>HIGH_VOLTAGE</name>				
							<description>High voltage. VDDA = 2.7 V to 3.6 V.</description>				
							<value>0</value>				
						</enumeratedValue>					
						<enumeratedValue>					
							<name>LOW_VOLTAGE</name>				
							<description>Low voltage. VDDA = 2.4 V to 2.7 V.</description>				
							<value>1</value>				
						</enumeratedValue>					
					</enumeratedValues>						
				</field>							
				<field>							
					<name>RESERVED</name>						
					<description>Reserved.</description>						
					<bitRange>[31:6]</bitRange>						
											
				</field>							
			</fields>								
		</register>									
		
	</registers>
		</peripheral>
		
		<peripheral>
			<name>DAC</name>
			<description>12-bit DAC Modification  </description>
			<groupName>DAC</groupName>
			<baseAddress>0x40004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>DAC</name>
				<value>39</value>
			</interrupt>
			<registers>
				<register>
					<name>VAL</name>
					<description>D/A Converter Value Register. This register contains the digital value to be converted to analog.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Software should only write zeros to unused bits.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>VALUE</name>
							<description>The voltage on the DAC_OUT pin (with respect to VSSA) is VALUE  x ((VREFP - V REFN)/4096) + VREFN.  This voltage will be stable the selected settling time (specified by the BIAS field in the DAC Control Register) after this field is modified.</description>
							<bitRange>[15:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Software should only write zeros to unused bits.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL</name>
					<description>DAC Control register. This register contains bits to configure DAC operation and the interrupt/dma request flag.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INT_DMA_FLAG</name>
							<description>Interrupt/DMA request flag. This bit is read-only. 0 = This bit is cleared upon any write to the DACVAL register. 1 = This bit is set by hardware only if a hardware trigger has been selected as follows: - If the internal timer is selected, this bit will be set when the timer times-out.  - If an external trigger input is selected, this bit will be set when a transition of the specified polarity is detected on the selected input.</description>
							<bitRange>[0:0]</bitRange>
						
						</field>
						<field>
							<name>TRIG_SRC</name>
							<description>Hardware Trigger Source: If anyof these hardware trigger sources are selected, an interrupt/dma request will be generated when the specified trigger occurs. In addition, if double-buffering is enabled (the DBLBUF_ENA' bit is set), the DACVAL register will be loaded from the pre-buffer at the same time.</description>
							<bitRange>[3:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERNAL</name>
									<description>Internal. Selects the internal timer as the trigger source provided the timer is enabled (the TIMER_ENA bit is set). Otherwise (if the timer is not enabled), hardware triggering is disabled.  If hardware triggering is disabled no interrupt or DMA requests will be generated. Double-buffering of the DAC VAL register is not useful and cannot be enabled when hardware triggering is disabled.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN</name>
									<description>Pin. External DAC_TRIG port input is selected. Also select this function in the PINASSIGN11 register in the switchmatrix.</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POLARITY</name>
							<description>Specifies the polarity of the selected external trigger input.  Does not apply if the TRIG_SRC field is set to 0.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RISING</name>
									<description>Rising. A trigger will be asserted when a RISING edge is detected on the selected external trigger input.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>Falling. A trigger will be asserted when a FALLING edge is detected on the selected external trigger input.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYNC_BYPASS</name>
							<description>Permits bypassing of one synchronization flip-flop, if not required. Does not apply if the TRIG_SRC field is set to 0.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SYNCHRONIZE</name>
									<description>Synchronize. The selected trigger input will be synchronized to the system clock prior to edge-detection.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOT_SYNCHRONIZE</name>
									<description>Not synchronize. The selected trigger input will not be synchronized to the system clock prior to edge-detection. This will save one clock of latency.   This bit should only be set f the selected hardware input trigger is from a source that is guaranteeed to already be synchronous to the system clock.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIMER_ENA</name>
							<description>Timer Enable</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The internal timer is disabled. If the TRIG_SEL field is also set to 000 then hardware triggering is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The internal timer is enabled and counting.  Note: This bit should only be set after a valid count value has been programmed into the DACCNTVAL register.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBLBUF_ENA</name>
							<description>Double-Buffer Enable.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Double-buffering of the DACVAL register is disabled. Software writes to the DACVAL address will directly modify the DAC data presented to the D/A converter. Hardware trigger events, if selected, will not affect the DACVAL contents.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The double-buffering feature in the DACVAL register is enabled. Writes to the DACVAL register are written to a pre-buffer and then transferred to the DACVAL when the specified hardware trigger occurs.  Setting this bit will have no effect if hardware triggering is disabled. Double-buffering is of no value under this condition.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SHUTOFF_ENA</name>
							<description>Shutoff Enable</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The hardware DAC-shutoff feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The hardware DAC-shutoff feature is enabled. Whenever the DAC_SHUTOFF (port pin) input is high, the DAC output voltage will be forced to zero. The DAC output will return to the value specifed in the DACVAL register once the input pin returns to the low state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SHUTOFF_FLAG</name>
							<description>Shutoff Flag. This is a read-only bit. Reflects the state of the DAC_SHUTOFF input if the Shutoff feature is enabled. 0 = DAC_SHUTOFF (port pin) input is low. DAC is outputting the voltage specified in the DAC VAL register. 1 = DAC_SHUTOFF (port pin) input is high. The DAC output is forced to zero. This bit serves as a flag only, If a processor interrupt is desired when a DAC shutoff condition occurrs, that can be accomplished by enabling the port pin selected as the DAC_SHUTOFF pin to directly generate a port interrupt.</description>
							<bitRange>[9:9]</bitRange>
							
