cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
						</field>
						<field>
							<name>BIAS</name>
							<description>These bits permit trading-off longer DAC settling times to achieve reduced power consumption. The default setting provides maximum speed but also maximum power.</description>
							<bitRange>[12:10]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Software should only write zeros to unused bits.</description>
							<bitRange>[31:13]</bitRange>
						
						</field>
					</fields>
				</register>
				<register>
					<name>CNTVAL</name>
					<description>DAC Counter Value register. This register contains the reload value for the internal DAC DMA/Interrupt timer.</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CNTVAL</name>
							<description>16-bit reload value for the internal DAC interrupt/DMA timer. The timer will overflow at the fixed rate of the system clock divided by CNTVAL+1.  Upon each overflow an interrupt/dma request will be generated and the DAC VAL register contents will be updated if double-buffering is enabled.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Software should only write zeros to unused bits.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		

		
		<peripheral>
	<name>ACMP</name>
	<description>Analog comparators ACMP0/1/2/3</description>
	<groupName>ACMP</groupName>
	<baseAddress>0x40008000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>CMP0</name>
	<value>40</value>
	</interrupt>
	<interrupt>
	<name>CMP1</name>
	<value>41</value>
	</interrupt>
	<interrupt>
	<name>CMP2</name>
	<value>42</value>
	</interrupt>
	<interrupt>
	<name>CMP3</name>
	<value>43</value>
	</interrupt>
	<registers>
		<register>
			<name>CTRL</name>
			<description>Comparator block control register</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[7:0]</bitRange>
			
				</field>
				<field>
					<name>ROSCCTL</name>
					<description>Selects the which comparators set and reset the ROSC output.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ACMP1_ACMP0</name>
							<description>ACMP1/ACMP0. The ROSC output is set by ACMP1 and reset by ACMP0.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP0_ACMP1</name>
							<description>ACMP0/ACMP1. The ROSC output is set by ACMP0 and reset by ACMP1.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EXT_RESET</name>
					<description>Selects the reset source for the ROSC output.</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INTERNAL</name>
							<description>Internal. The ROSC output is reset by the internal chip reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FROM_PIN_ROSC_RESET</name>
							<description>From pin ROSC_RESET. The ROSC output is reset by the ROSC_RESET input.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:10]</bitRange>
			
				</field>
			</fields>
		</register>
		<register>
			<name>CMP0</name>
			<description>Comparator 0 source control</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EN</name>
					<description>Comparator enable control.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. Comparator disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. Comparator is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[1:1]</bitRange>
			
				</field>
				<field>
					<name>INTEN</name>
					<description>Interrupt enable.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. Interrupts are disabled..</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. Interrupts are enabled.. Must set to 1 for interrupts to propagate to the NVIC and start-up logic.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>STAT</name>
					<description>Comparator status. This bit reflects the comparator output</description>
					<bitRange>[3:3]</bitRange>
			
				</field>
				<field>
					<name>VM</name>
					<description>VM input select.</description>
					<bitRange>[6:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VREF_DIVIDER_0</name>
							<description>Vref divider 0.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP_I1</name>
							<description>ACMP_I1.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP_I2</name>
							<description>ACMP_I2.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP0_I3</name>
							<description>ACMP0_I3.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP0_I4</name>
							<description>ACMP0_I4.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERNAL_0</name>
							<description>Internal 0.9 V band gap reference.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TEMP_SENSOR</name>
							<description>Temp sensor.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ADC0_2</name>
							<description>ADC0_2. Input for ADC0 channel 2.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[7:7]</bitRange>
			
