cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
				</field>
				<field>
					<name>VLADREF</name>
					<description>Voltage reference select for comparator 0 voltage ladder.</description>
					<bitRange>[22:22]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VREF_CMP_PIN</name>
							<description>VREF_CMP pin.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>VDDA_PIN</name>
							<description>VDDA pin.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[23:23]</bitRange>
			
				</field>
				<field>
					<name>VSEL</name>
					<description>Voltage ladder value for comparator 0. The reference voltage Vref depends on the setting of VLADREF (either VDD(3V3) or voltage on pin VREF_CMP). 00000 = Vss. 00001 = 1 x Vref / 31. 00010 = 2 x Vref / 31. ... 11111 = Vref</description>
					<bitRange>[28:24]</bitRange>
			
				</field>
				<field>
					<name>DLY</name>
					<description>Configure the propagation delay. A shorter propagation delay means higher power consumption. Use values from 0x0 (shortest propagation delay and highest power consumption) to 0x2 (longest propagation delay and lowest power consumption). See the  data sheet for details.</description>
					<bitRange>[30:29]</bitRange>
			
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:31]</bitRange>
			
				</field>
			</fields>
		</register>
		<register>
			<name>CMP1</name>
			<description>Comparator 1 source control</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EN</name>
					<description>Comparator enable control.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. Comparator disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. Comparator is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[1:1]</bitRange>
			
				</field>
				<field>
					<name>INTEN</name>
					<description>Interrupt enable.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. Interrupts are disabled..</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. Interrupts are enabled.. Must set to 1 for interrupts to propagate to the NVIC and start-up logic.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>STAT</name>
					<description>Comparator status. This bit reflects the comparator output</description>
					<bitRange>[3:3]</bitRange>
			
				</field>
				<field>
					<name>VM</name>
					<description>VM input select.</description>
					<bitRange>[6:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VREF_DIVIDER_1</name>
							<description>Vref divider 1.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP_I1</name>
							<description>ACMP_I1.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP_I2</name>
							<description>ACMP_I2.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP1_I3</name>
							<description>ACMP1_I3.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP1_I4</name>
							<description>ACMP1_I4.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERNAL_0</name>
							<description>Internal 0.9 V band gap reference.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ADC0_1</name>
							<description>ADC0_1. Input for ADC0 channel 1.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ADC0_3</name>
							<description>ADC0_3. Input for ADC0 channel 3.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[7:7]</bitRange>
			
				</field>
				<field>
					<name>VP</name>
					<description>VP input select.</description>
					<bitRange>[10:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VREF_DIVIDER_1</name>
							<description>Vref divider 1.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP_I1</name>
							<description>ACMP_I1.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP_I2</name>
							<description>ACMP_I2.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP1_I3</name>
							<description>ACMP1_I3.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP1_I4</name>
							<description>ACMP1_I4.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERNAL_0</name>
							<description>Internal 0.9 V band gap reference.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ADC0_1</name>
							<description>ADC0_1. Input for ADC0 channel 1.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ADC0_3</name>
							<description>ADC0_3. Input for ADC0 channel 3.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[12:11]</bitRange>
			
