cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
				</field>
				<field>
					<name>HYS</name>
					<description>Hysteresis control. When enabled, hysteresis determines the difference required between the comparator inputs before the comparator output switches. The difference must be in the direction opposite of the current comparator output.</description>
					<bitRange>[14:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>HYSTERESIS_IS_TURNED</name>
							<description>Hysteresis is turned off, comparator output will change as the input voltages cross.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HYSTERESIS_EQ_5_MV</name>
							<description>Hysteresis = 5 mV.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HYSTERESIS_EQ_10_MV</name>
							<description>Hysteresis = 10 mV.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HYSTERESIS_EQ_15_MV</name>
							<description>Hysteresis = 15 mV.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTPOL</name>
					<description>Selects the polarity of the CMP output for purposes of generating level interrupts.</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_INVERTED</name>
							<description>Not inverted. The output is used as-is for generating interrupts.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INVERTED</name>
							<description>Inverted. The output is used inverted for generating interrupts.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTTYPE</name>
					<description>Select interrupt type.</description>
					<bitRange>[16:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>EDGE</name>
							<description>Edge. Comparator interrupt is edge triggered.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LEVEL</name>
							<description>Level. Comparator interrupt is level triggered.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTEDGE</name>
					<description>Select edge triggered interrupt to be active on either high or low transitions, when INTTYPE = 0.</description>
					<bitRange>[18:17]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>FALLING</name>
							<description>Falling. Comparator interrupt is active on falling edges.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING</name>
							<description>Rising. Comparator interrupt is active on rising edges.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BOTH_EDGES</name>
							<description>Both edges. Comparator Interrupt is active on both edges.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTFLAG</name>
					<description>Interrupt flag.</description>
					<bitRange>[19:19]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_PENDING</name>
							<description>Not pending. The Comparator interrupt is not pending.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PENDING</name>
							<description>Pending. The Comparator interrupt is pending. Writing a 1 to this bit clears the flag.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>VLADEN</name>
					<description>Voltage ladder enable for comparator 3.</description>
					<bitRange>[20:20]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. The Comparator voltage ladder is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. The Comparator voltage ladder is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[21:21]</bitRange>
			
				</field>
				<field>
					<name>VLADREF</name>
					<description>Voltage reference select for comparator 3 voltage ladder.</description>
					<bitRange>[22:22]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VREF_CMP_PIN</name>
							<description>VREF_CMP pin.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>VDDA_PIN</name>
							<description>VDDA pin.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[23:23]</bitRange>
			
				</field>
				<field>
					<name>VSEL</name>
					<description>Voltage ladder value for comparator 3. The reference voltage Vref depends on the setting of VLADREF (either VDD(3V3) or voltage on pin VREF_CMP). 00000 = Vss. 00001 = 1 x Vref / 31. 00010 = 2 x Vref / 31. ... 11111 = Vref</description>
					<bitRange>[28:24]</bitRange>
			
				</field>
				<field>
					<name>DLY</name>
					<description>Configure the propagation delay. A shorter propagation delay means higher power consumption. Use values from 0x0 (shortest propagation delay and highest power consumption) to 0x2 (longest propagation delay and lowest power consumption). See the  data sheet for details.</description>
					<bitRange>[30:29]</bitRange>
			
