cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		
		<peripheral>
	<name>USART0</name>
	<description>USART0 </description>
	<groupName>USART0</groupName>
	<baseAddress>0x40040000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>UART0</name>
	<value>21</value>
	</interrupt>
	<registers>														
	<register>													
		<name>CFG</name>												
		<description>USART Configuration register. Basic USART configuration settings that typically are not changed during operation.</description>												
		<addressOffset>0x000</addressOffset>												
		<access>read-write</access>												
		<resetValue>0</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>ENABLE</name>										
				<description>USART Enable.</description>										
				<bitRange>[0:0]</bitRange>										
				<enumeratedValues>										
				<name>ENUM</name>										
					<enumeratedValue>									
						<name>DISABLED</name>								
						<description>Disabled. The USART is disabled and the internal state machine and counters are reset. While Enable = 0, all USART interrupts and DMA transfers are disabled. When Enable is set again, CFG and most other control bits remain unchanged. For instance, when re-enabled, the USART will immediately generate a TxRdy interrupt (if  enabled in the INTENSET register) or a DMA transfer request because the transmitter has been reset and is therefore available.</description>								
						<value>0</value>								
					</enumeratedValue>									
					<enumeratedValue>									
						<name>ENABLED</name>								
						<description>Enabled. The USART is enabled for operation.</description>								
						<value>1</value>								
					</enumeratedValue>									
				</enumeratedValues>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved. Read value is undefined, only zero should be written.</description>										
				<bitRange>[1:1]</bitRange>										
									
			</field>											
			<field>											
				<name>DATALEN</name>										
				<description>Selects the data size for the USART.</description>										
				<bitRange>[3:2]</bitRange>										
				<enumeratedValues>										
				<name>ENUM</name>										
					<enumeratedValue>									
						<name>7_BIT_DATA_LENGTH</name>								
						<description>7 bit Data length.</description>								
						<value>0x0</value>								
					</enumeratedValue>									
					<enumeratedValue>									
						<name>8_BIT_DATA_LENGTH</name>								
						<description>8 bit Data length.</description>								
						<value>0x1</value>								
					</enumeratedValue>									
					<enumeratedValue>									
						<name>9_BIT_DATA_LENGTH</name>								
						<description>9 bit data length. The 9th bit is commonly used for addressing in multidrop mode. See the ADDRDET bit in the CTL register.</description>								
						<value>0x2</value>								
					</enumeratedValue>									
					<enumeratedValue>									
						<name>RESERVED</name>								
						<description>Reserved.</description>								
						<value>0x3</value>								
					</enumeratedValue>									
				</enumeratedValues>										
			</field>											
			<field>											
				<name>PARITYSEL</name>										
				<description>Selects what type of parity is used by the USART.</description>										
				<bitRange>[5:4]</bitRange>										
				<enumeratedValues>										
				<name>ENUM</name>										
					<enumeratedValue>									
						<name>NO_PARITY</name>								
						<description>No parity.</description>								
						<value>0x0</value>								
					</enumeratedValue>									
					<enumeratedValue>									
						<name>RESERVED</name>								
						<description>Reserved.</description>								
						<value>0x1</value>								
					</enumeratedValue>									
					<enumeratedValue>									
						<name>EVEN_PARITY</name>								
						<description>Even parity. Adds a bit to each character such that the number of 1s in a transmitted character is even, and the number of 1s in a received character is expected to be even.</description>								
						<value>0x2</value>								
					</enumeratedValue>									
					<enumeratedValue>									
						<name>ODD_PARITY</name>								
						<description>Odd parity. Adds a bit to each character such that the number of 1s in a transmitted character is odd, and the number of 1s in a received character is expected to be odd.</description>								
						<value>0x3</value>								
					</enumeratedValue>									
				</enumeratedValues>										
			</field>											
			<field>											
				<name>STOPLEN</name>										
				<description>Number of stop bits appended to transmitted data. Only a single stop bit is required for received data.</description>										
				<bitRange>[6:6]</bitRange>										
				<enumeratedValues>										
				<name>ENUM</name>										
					<enumeratedValue>									
						<name>1_STOP_BIT</name>								
						<description>1 stop bit.</description>								
						<value>0</value>								
					</enumeratedValue>									
					<enumeratedValue>									
						<name>2_STOP_BITS</name>								
						<description>2 stop bits. This setting should only be used for asynchronous communication.</description>								
						<value>1</value>								
					</enumeratedValue>									
				</enumeratedValues>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved. Only write 0 to this bit.</description>										
				<bitRange>[7:7]</bitRange>										
									
			</field>											
			<field>											
				<name>MODE32K</name>										
				<description>Selects standard or 32 kHz clocking mode.</description>										
				<bitRange>[7:7]</bitRange>										
				<enumeratedValues>										
				<name>ENUM</name>										
					<enumeratedValue>									
						<name>UART_USES_STANDARD_C</name>								
						<description>UART uses standard clocking.</description>								
						<value>0</value>								
					</enumeratedValue>									
					<enumeratedValue>									
						<name>UART_USES_THE_32_KHZ</name>								
						<description>UART uses the 32 kHz clock from the RTC oscillator as the clock source to the BRG, and uses a special bit clocking scheme.</description>								
						<value>1</value>								
					</enumeratedValue>									
				</enumeratedValues>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved. Read value is undefined, only zero should be written.</description>										
				<bitRange>[8:8]</bitRange>										
									
