cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
	<register>													
		<name>INTSTAT</name>												
		<description>Interrupt status register. Reflects interrupts that are currently enabled.</description>												
		<addressOffset>0x024</addressOffset>												
		<access>read-only</access>												
		<resetValue>0x0005</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>RXRDY</name>										
				<description>Receiver Ready flag.</description>										
				<bitRange>[0:0]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved. Read value is undefined, only zero should be written.</description>										
				<bitRange>[1:1]</bitRange>										
			</field>											
			<field>											
				<name>TXRDY</name>										
				<description>Transmitter Ready flag.</description>										
				<bitRange>[2:2]</bitRange>										
			</field>											
			<field>											
				<name>TXIDLE</name>										
				<description>Transmitter Idle status.</description>										
				<bitRange>[3:3]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved. Read value is undefined, only zero should be written.</description>										
				<bitRange>[4:4]</bitRange>										
			</field>											
			<field>											
				<name>DELTACTS</name>										
				<description>This bit is set when a change in the state of the CTS input is detected.</description>										
				<bitRange>[5:5]</bitRange>										
			</field>											
			<field>											
				<name>TXDISINT</name>										
				<description>Transmitter Disabled Interrupt flag.</description>										
				<bitRange>[6:6]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved. Read value is undefined, only zero should be written.</description>										
				<bitRange>[7:7]</bitRange>										
			</field>											
			<field>											
				<name>OVERRUNINT</name>										
				<description>Overrun Error interrupt flag.</description>										
				<bitRange>[8:8]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved. Read value is undefined, only zero should be written.</description>										
				<bitRange>[10:9]</bitRange>										
			</field>											
			<field>											
				<name>DELTARXBRK</name>										
				<description>This bit is set when a change in the state of receiver break detection occurs.</description>										
				<bitRange>[11:11]</bitRange>										
			</field>											
			<field>											
				<name>START</name>										
				<description>This bit is set when a start is detected on the receiver input.</description>										
				<bitRange>[12:12]</bitRange>										
			</field>											
			<field>											
				<name>FRAMERRINT</name>										
				<description>Framing Error interrupt flag.</description>										
				<bitRange>[13:13]</bitRange>										
			</field>											
			<field>											
				<name>PARITYERRINT</name>										
				<description>Parity Error interrupt flag.</description>										
				<bitRange>[14:14]</bitRange>										
			</field>											
			<field>											
				<name>RXNOISEINT</name>										
				<description>Received Noise interrupt flag.</description>										
				<bitRange>[15:15]</bitRange>										
			</field>											
			<field>											
				<name>ABERRINT</name>										
				<description>Auto baud Error Interrupt flag.</description>										
				<bitRange>[16:16]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved. Read value is undefined, only zero should be written.</description>										
				<bitRange>[31:17]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>OSR</name>												
		<description>Oversample selection register for asynchronous communication.</description>												
		<addressOffset>0x028</addressOffset>												
		<access>read-write</access>												
		<resetValue>0xF</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>OSRVAL</name>										
				<description>Oversample Selection Value. 0 to 3 = not supported 0x4 = 5 peripheral clocks are used to transmit and receive each data bit. 0x5 = 6 peripheral clocks are used to transmit and receive each data bit.  ... 0xF= 16 peripheral clocks are used to transmit and receive each data bit.</description>										
				<bitRange>[3:0]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved, the value read from a reserved bit is not defined.</description>										
				<bitRange>[31:4]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>ADDR</name>												
		<description>Address register for automatic address matching.</description>												
		<addressOffset>0x02C</addressOffset>												
		<access>read-write</access>												
		<resetValue>0</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>ADDRESS</name>										
				<description>8-bit address used with automatic address matching. Used when address detection is enabled (ADDRDET in CTL = 1) and automatic address matching is enabled (AUTOADDR in CFG = 1).</description>										
				<bitRange>[7:0]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved, the value read from a reserved bit is not defined.</description>										
				<bitRange>[31:8]</bitRange>										
			</field>											
		</fields>												
	</register>													
