cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
			</field>														
			<field>														
				<name>SLVNOTSTREN</name>													
				<description>Slave Not Stretching interrupt Enable.</description>													
				<bitRange>[11:11]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>THE_SLVNOTSTR_INTERR</name>											
						<description>The SlvNotStr interrupt is disabled.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>THE_SLVNOTSTR_INTERR</name>											
						<description>The SlvNotStr interrupt is enabled.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. Read value is undefined, only zero should be written.</description>													
				<bitRange>[14:12]</bitRange>													
												
			</field>														
			<field>														
				<name>SLVDESELEN</name>													
				<description>Slave Deselect interrupt Enable.</description>													
				<bitRange>[15:15]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>THE_SLVDESEL_INTERRU</name>											
						<description>The SlvDeSel interrupt is disabled.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>THE_SLVDESEL_INTERRU</name>											
						<description>The SlvDeSel interrupt is enabled.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>MONRDYEN</name>													
				<description>Monitor data Ready interrupt Enable.</description>													
				<bitRange>[16:16]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>THE_MONRDY_INTERRUPT</name>											
						<description>The MonRdy interrupt is disabled.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>THE_MONRDY_INTERRUPT</name>											
						<description>The MonRdy interrupt is enabled.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>MONOVEN</name>													
				<description>Monitor Overrun interrupt Enable.</description>													
				<bitRange>[17:17]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>THE_MONOV_INTERRUPT</name>											
						<description>The MonOv interrupt is disabled.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>THE_MONOV_INTERRUPT</name>											
						<description>The MonOv interrupt is enabled.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. Read value is undefined, only zero should be written.</description>													
				<bitRange>[18:18]</bitRange>													
												
			</field>														
			<field>														
				<name>MONIDLEEN</name>													
				<description>Monitor Idle interrupt Enable.</description>													
				<bitRange>[19:19]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>THE_MONIDLE_INTERRUP</name>											
						<description>The MonIdle interrupt is disabled.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>THE_MONIDLE_INTERRUP</name>											
						<description>The MonIdle interrupt is enabled.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. Read value is undefined, only zero should be written.</description>													
				<bitRange>[23:20]</bitRange>													
												
			</field>														
			<field>														
				<name>EVENTTIMEOUTEN</name>													
				<description>Event time-out interrupt Enable.</description>													
				<bitRange>[24:24]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>THE_EVENT_TIME_OUT_I</name>											
						<description>The Event time-out interrupt is disabled.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>THE_EVENT_TIME_OUT_I</name>											
						<description>The Event time-out interrupt is enabled.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>SCLTIMEOUTEN</name>													
				<description>SCL time-out interrupt Enable.</description>													
				<bitRange>[25:25]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>THE_SCL_TIME_OUT_INT</name>											
						<description>The SCL time-out interrupt is disabled.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>THE_SCL_TIME_OUT_INT</name>											
						<description>The SCL time-out interrupt is enabled.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. Read value is undefined, only zero should be written.</description>													
				<bitRange>[31:26]</bitRange>													
												
