cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>MSTTIME</name>															
		<description>Master timing configuration.</description>															
		<addressOffset>0x24</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x77</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>MSTSCLLOW</name>													
				<description>Master SCL Low time. Specifies the minimum low time that will be asserted by this master on SCL. Other devices on the bus (masters or slaves) could lengthen this time. This corresponds to the parameter tLOW in the I2C bus specification. I2C bus specification parameters tBUF and t SU;STA have the same values and are also controlled by MSTSCLLOW.</description>													
				<bitRange>[2:0]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>2_CLOCKS</name>											
						<description>2 clocks. Minimum SCL low time is 2 clocks of the I2C clock pre-divider.</description>											
						<value>0x0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>3_CLOCKS</name>											
						<description>3 clocks. Minimum SCL low time is 3 clocks of the I2C clock pre-divider.</description>											
						<value>0x1</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>4_CLOCKS</name>											
						<description>4 clocks. Minimum SCL low time is 4 clocks of the I2C clock pre-divider.</description>											
						<value>0x2</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>5_CLOCKS</name>											
						<description>5 clocks. Minimum SCL low time is 5 clocks of the I2C clock pre-divider.</description>											
						<value>0x3</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>6_CLOCKS</name>											
						<description>6 clocks. Minimum SCL low time is 6 clocks of the I2C clock pre-divider.</description>											
						<value>0x4</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>7_CLOCKS</name>											
						<description>7 clocks. Minimum SCL low time is 7 clocks of the I2C clock pre-divider.</description>											
						<value>0x5</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>8_CLOCKS</name>											
						<description>8 clocks. Minimum SCL low time is 8 clocks of the I2C clock pre-divider.</description>											
						<value>0x6</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>9_CLOCKS</name>											
						<description>9 clocks. Minimum SCL low time is 9 clocks of the I2C clock pre-divider.</description>											
						<value>0x7</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved.</description>													
				<bitRange>[3:3]</bitRange>													
												
			</field>														
			<field>														
				<name>MSTSCLHIGH</name>													
				<description>Master SCL High time. Specifies the minimum high time that will be asserted by this master on SCL. Other masters in a multi-master system could shorten this time. This corresponds to the parameter tHIGH in the I2C bus specification. I2C bus specification parameters tSU;STO and tHD;STA have the same values and are also controlled by MSTSCLHIGH.</description>													
				<bitRange>[6:4]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>2_CLOCKS</name>											
						<description>2 clocks. Minimum SCL high time is 2 clock of the I2C clock pre-divider.</description>											
						<value>0x0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>3_CLOCKS</name>											
						<description>3 clocks. Minimum SCL high time is 3 clocks of the I2C clock pre-divider .</description>											
						<value>0x1</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>4_CLOCKS</name>											
						<description>4 clocks. Minimum SCL high time is 4 clock of the I2C clock pre-divider.</description>											
						<value>0x2</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>5_CLOCKS</name>											
						<description>5 clocks. Minimum SCL high time is 5 clock of the I2C clock pre-divider.</description>											
						<value>0x3</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>6_CLOCKS</name>											
						<description>6 clocks. Minimum SCL high time is 6 clock of the I2C clock pre-divider.</description>											
						<value>0x4</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>7_CLOCKS</name>											
						<description>7 clocks. Minimum SCL high time is 7 clock of the I2C clock pre-divider.</description>											
						<value>0x5</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>8_CLOCKS</name>											
						<description>8 clocks. Minimum SCL high time is 8 clock of the I2C clock pre-divider.</description>											
						<value>0x6</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>9_CLOCKS</name>											
						<description>9 clocks. Minimum SCL high time is 9 clocks of the I2C clock pre-divider.</description>											
						<value>0x7</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. Read value is undefined, only zero should be written.</description>													
				<bitRange>[31:7]</bitRange>													
												
