cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>MSTDAT</name>															
		<description>Combined Master receiver and transmitter data register.</description>															
		<addressOffset>0x28</addressOffset>															
		<access>read-write</access>															
		<resetValue>0</resetValue>															
		<resetMask>0x00000000</resetMask>															
		<fields>															
			<field>														
				<name>DATA</name>													
				<description>Master function data register. Read: read the most recently received data for the Master function. Write: transmit data using the Master function.</description>													
				<bitRange>[7:0]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. Read value is undefined, only zero should be written.</description>													
				<bitRange>[31:8]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>SLVCTL</name>															
		<description>Slave control register.</description>															
		<addressOffset>0x40</addressOffset>															
		<access>read-write</access>															
		<resetValue>0</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>SLVCONTINUE</name>													
				<description>Slave Continue.</description>													
				<bitRange>[0:0]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>NO_EFFECT</name>											
						<description>No effect.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>CONTINUE</name>											
						<description>Continue. Informs the Slave function to continue to the next operation. This must done after writing transmit data, reading received data, or any other housekeeping related to the next bus operation.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>SLVNACK</name>													
				<description>Slave NACK.</description>													
				<bitRange>[1:1]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>NO_EFFECT</name>											
						<description>No effect.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>NACK</name>											
						<description>NACK. Causes the Slave function to NACK the master when the slave is receiving data from the master (Slave Receiver mode).</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. Read value is undefined, only zero should be written.</description>													
				<bitRange>[2:2]</bitRange>													
				
			</field>
			<field>														
				<name>SLVDMA</name>													
				<description>Slave DMA enable.</description>													
				<bitRange>[3:3]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>DISABLED</name>											
						<description>Disabled. No DMA requests are issued for Slave mode operation.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>ENABLED</name>											
						<description>Enabled. DMA requests are issued for I2C slave data transmission and reception.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. Read value is undefined, only zero should be written.</description>													
				<bitRange>[31:4]</bitRange>													
												
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>SLVDAT</name>															
		<description>Combined Slave receiver and transmitter data register.</description>															
		<addressOffset>0x44</addressOffset>															
		<access>read-write</access>															
		<resetValue>0</resetValue>															
		<resetMask>0x00000000</resetMask>															
		<fields>															
			<field>														
				<name>DATA</name>													
				<description>Slave function data register. Read: read the most recently received data for the Slave function. Write: transmit data using the Slave function.</description>													
				<bitRange>[7:0]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. Read value is undefined, only zero should be written.</description>													
				<bitRange>[31:8]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<dim>4</dim>															
		<dimIncrement>0x4</dimIncrement>															
		<dimIndex>0-3</dimIndex>															
		<name>SLVADR%s</name>															
		<description>Slave address 0.</description>															
		<addressOffset>0x48</addressOffset>															
		<access>read-write</access>															
		<resetValue>0x01</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>SADISABLE</name>													
				<description>Slave Address n Disable.</description>													
				<bitRange>[0:0]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>ENABLED</name>											
						<description>Enabled. Slave Address n is enabled and will be recognized with any changes specified by the SLVQUAL0 register.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>IGNORED_SLAVE_ADDRES</name>											
						<description>Ignored Slave Address n is ignored.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>SLVADR</name>													
				<description>Seven bit slave address that is compared to received addresses if enabled.</description>													
				<bitRange>[7:1]</bitRange>													
												
