cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
				</field>
				<field>
					<name>FLASH_RST</name>
					<description>Flash reset control</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_FLASH_RESET_</name>
							<description>Clear flash reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_FLASH_RESET_</name>
							<description>Assert flash reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>FMC_RST</name>
					<description>FMC reset control FMC? Is this the flash controller?</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_FMC_RESET_</name>
							<description>Clear FMC reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_FMC_RESET_</name>
							<description>Assert FMC reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EEPROM_RST</name>
					<description>EEPROM reset control</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_EEPROM_RESET_</name>
							<description>Clear EEPROM reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_EEPROM_RESET_</name>
							<description>Assert EEPROM reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[10:10]</bitRange>
				
				</field>
				<field>
					<name>PMUX_RST</name>
					<description>Pin mux reset control</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_PIN_MUX_RESET_</name>
							<description>Clear pin mux reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_PIN_MUX_RESET</name>
							<description>Assert pin mux reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[12:12]</bitRange>
				
				</field>
				<field>
					<name>IOCON_RST</name>
					<description>IOCON reset control</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_IOCON_RESET_</name>
							<description>Clear IOCON reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_IOCON_RESET_</name>
							<description>Assert IOCON reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>GPIO0_RST</name>
					<description>GPIO0 reset control</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_GPIO0_RESET_</name>
							<description>Clear GPIO0 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_GPIO0_RESET_</name>
							<description>Assert GPIO0 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>GPIO1_RST</name>
					<description>GPIO1 reset control</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_GPIO1_RESET_</name>
							<description>Clear GPIO1 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_GPIO1_RESET_</name>
							<description>Assert GPIO1 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>GPIO2_RST</name>
					<description>GPIO2 reset control</description>
					<bitRange>[16:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_GPIO2_RESET_</name>
							<description>Clear GPIO2 reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_GPIO2_RESET_</name>
							<description>Assert GPIO2 reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[17:17]</bitRange>
				
				</field>
				<field>
					<name>PINT_RST</name>
					<description>Pin interrupt (PINT) reset control</description>
					<bitRange>[18:18]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_PINT_RESET_</name>
							<description>Clear PINT reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_PINT_RESET_</name>
							<description>Assert PINT reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>GINT_RST</name>
					<description>Grouped interrupt (GINT) reset control</description>
					<bitRange>[19:19]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_GINT_RESET_</name>
							<description>Clear GINT reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_GINT_RESET_</name>
							<description>Assert GINT reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMA_RST</name>
					<description>DMA reset control</description>
					<bitRange>[20:20]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_DMA_RESET_</name>
							<description>Clear DMA reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_DMA_RESET_</name>
							<description>Assert DMA reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CRC_RST</name>
					<description>CRC generator reset control</description>
					<bitRange>[21:21]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CLEAR_CRC_RESET_</name>
							<description>Clear CRC reset.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASSERT_CRC_RESET_</name>
							<description>Assert CRC reset.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[26:22]</bitRange>
				
