cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
				</field>
				<field>
					<name>RTCALARM</name>
					<description>RTC alarm interrupt wake-up</description>
					<bitRange>[13:13]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RTCWAKE</name>
					<description>RTC wake-up interrupt wake-up</description>
					<bitRange>[14:14]</bitRange>
										
					<enumeratedValues>
					<name>ENUM</name>
										
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:15]</bitRange>
				</field>
			</fields>
		</register>
										
										
	</registers>
		</peripheral>
		<peripheral derivedFrom="ADC0">
			<name>ADC1</name>
			<description>ADC1</description>
			<baseAddress>0x40080000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC1_SEQA</name>
				<value>35</value>
			</interrupt>
			<interrupt>
				<name>ADC1_SEQB</name>
				<value>36</value>
			</interrupt>
			<interrupt>
				<name>ADC1_THCMP</name>
				<value>37</value>
			</interrupt>
			<interrupt>
				<name>ADC1_OVR</name>
				<value>38</value>
			</interrupt>
		</peripheral>
		
		<peripheral>
	<name>MRT</name>
	<description>Multi-Rate Timer (MRT) </description>
	<groupName>MRT</groupName>
	<baseAddress>0x400A0000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
			<interrupt>
				<name>MRT</name>
				<value>20</value>
			</interrupt>
	<registers>
		<register>
			<dim>4</dim>
			<dimIncrement>0x10</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>INTVAL%s</name>
			<description>MRT0 Time interval value register. This value is loaded into the TIMER0 register.</description>
			<addressOffset>0x0</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>IVALUE</name>
					<description>Time interval load value. This value is loaded into the TIMERn register and the MRTn starts counting down from IVALUE -1. If the timer is idle, writing a non-zero value to this bit field starts the timer immediately.  If the timer is running, writing a zero to this bit field does the following: If LOAD = 1, the timer stops immediately. If LOAD = 0, the timer stops at the end of the time interval.</description>
					<bitRange>[23:0]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[30:24]</bitRange>
			
				</field>
				<field>
					<name>LOAD</name>
					<description>Determines how the timer interval value IVALUE -1 is loaded into the TIMERn register. This bit is write-only. Reading this bit always returns 0.</description>
					<bitRange>[31:31]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_FORCE_LOAD</name>
							<description>No force load. The load from the INTVALn register to the TIMERn register is processed at the end of the time interval if the repeat mode is selected.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FORCE_LOAD</name>
							<description>Force load. The INTVALn interval value IVALUE -1 is immediately loaded into the TIMERn register while TIMERn is running.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
			</fields>
		</register>
		<register>
			<dim>4</dim>
			<dimIncrement>0x10</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>TIMER%s</name>
			<description>MRT0 Timer register. This register reads the value of the down-counter.</description>
			<addressOffset>0x4</addressOffset>
			<access>read-only</access>
			<resetValue>0xFFFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>VALUE</name>
					<description>Holds the current timer value of the down-counter. The initial value of the TIMERn register is loaded as IVALUE - 1 from the INTVALn register either at the end of the time interval or immediately in the following cases: INTVALn register is updated in the idle state. INTVALn register is updated with LOAD = 1. When the timer is in idle state, reading this bit fields returns -1 (0x00FF FFFF).</description>
					<bitRange>[23:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>4</dim>
			<dimIncrement>0x10</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>CTRL%s</name>
			<description>MRT0 Control register. This register controls the MRT0 modes.</description>
			<addressOffset>0x8</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INTEN</name>
					<description>Enable the TIMERn interrupt.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MODE</name>
					<description>Selects timer mode.</description>
					<bitRange>[2:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>REPEAT_INTERRUPT_MOD</name>
							<description>Repeat interrupt mode.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ONE_SHOT_INTERRUPT_M</name>
							<description>One-shot interrupt mode.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:3]</bitRange>
				
