cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
				</field>
			</fields>
		</register>
		<register>
			<dim>4</dim>
			<dimIncrement>0x10</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>STAT%s</name>
			<description>MRT0 Status register.</description>
			<addressOffset>0xC</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INTFLAG</name>
					<description>Monitors the interrupt flag.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_PENDING_INTERRUPT</name>
							<description>No pending interrupt. Writing a zero is equivalent to no operation.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PENDING_INTERRUPT</name>
							<description>Pending interrupt. The interrupt is pending because TIMERn has reached the end of the time interval. If the INTEN bit in the CONTROLn is also set to 1, the interrupt for timer channel n and the global interrupt are raised.  Writing a 1 to this bit clears the interrupt request.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RUN</name>
					<description>Indicates the state of TIMERn. This bit is read-only.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IDLE_STATE</name>
							<description>Idle state. TIMERn is stopped.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RUNNING</name>
							<description>Running. TIMERn is running.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:2]</bitRange>
				
				</field>
			</fields>
		</register>
		<register>
			<name>IDLE_CH</name>
			<description>Idle channel register. This register returns the number of the first idle channel.</description>
			<addressOffset>0xF4</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>CHAN</name>
					<description>Idle channel. Reading the CHAN bits, returns the lowest idle timer channel. If all timer channels are running, CHAN = 4.  To make sure that all outstanding interrupt requests have been serviced, a channel is considered idle only when both the corresponding RUN bit and the interrupt flag are zero in the STATUS register.</description>
					<bitRange>[7:4]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>IRQ_FLAG</name>
			<description>Global interrupt flag register</description>
			<addressOffset>0xF8</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>GFLAG0</name>
					<description>Monitors the interrupt flag of TIMER0.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_PENDING_INTERRUPT</name>
							<description>No pending interrupt. Writing a zero is equivalent to no operation.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PENDING_INTERRUPT</name>
							<description>Pending interrupt. The interrupt is pending because TIMER0 has reached the end of the time interval. If the INTEN bit in the CONTROL0 register is also set to 1, the interrupt for timer channel 0 and the global interrupt are raised.  Writing a 1 to this bit clears the interrupt request.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>GFLAG1</name>
					<description>Monitors the interrupt flag of TIMER1.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_PENDING_INTERRUPT</name>
							<description>No pending interrupt. Writing a zero is equivalent to no operation.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PENDING_INTERRUPT</name>
							<description>Pending interrupt. The interrupt is pending because TIMER1 has reached the end of the time interval. If the INTEN bit in the CONTROL1 register is also set to 1, the interrupt for timer channel 1 and the global interrupt are raised.  Writing a 1 to this bit clears the interrupt request.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>GFLAG2</name>
					<description>Monitors the interrupt flag of TIMER2.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_PENDING_INTERRUPT</name>
							<description>No pending interrupt. Writing a zero is equivalent to no operation.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PENDING_INTERRUPT</name>
							<description>Pending interrupt. The interrupt is pending because TIMER2 has reached the end of the time interval. If the INTEN bit in the CONTROL2 register is also set to 1, the interrupt for timer channel 2 and the global interrupt are raised.  Writing a 1 to this bit clears the interrupt request.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>GFLAG3</name>
					<description>Monitors the interrupt flag of TIMER3.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_PENDING_INTERRUPT</name>
							<description>No pending interrupt. Writing a zero is equivalent to no operation.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PENDING_INTERRUPT</name>
							<description>Pending interrupt. The interrupt is pending because TIMER3 has reached the end of the time interval. If the INTEN bit in the CONTROL3 register is also set to 1, the interrupt for timer channel 3 and the global interrupt are raised.  Writing a 1 to this bit clears the interrupt request.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:4]</bitRange>
				
