cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
	<register>																						
		<dim>3</dim>																					
		<dimIncrement>0x4</dimIncrement>																					
		<dimIndex>0-2</dimIndex>																					
		<name>PORT_ENA[%s]</name>
		<displayName>PORT_ENA[%s]</displayName>
		<description>GPIO grouped interrupt port 0 enable register</description>																					
		<addressOffset>0x040</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>ENA0</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[0:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA1</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[1:1]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA2</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[2:2]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA3</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[3:3]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA4</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[4:4]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA5</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[5:5]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA6</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[6:6]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA7</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[7:7]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA8</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[8:8]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA9</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[9:9]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA10</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[10:10]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA11</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[11:11]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA12</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[12:12]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA13</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[13:13]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA14</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[14:14]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA15</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[15:15]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA16</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[16:16]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA17</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[17:17]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA18</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[18:18]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA19</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[19:19]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA20</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[20:20]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA21</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[21:21]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA22</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[22:22]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA23</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[23:23]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA24</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[24:24]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA25</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[25:25]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA26</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[26:26]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA27</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[27:27]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA28</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[28:28]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA29</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[29:29]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA30</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[30:30]</bitRange>																			
			</field>																				
			<field>																				
				<name>ENA31</name>																			
				<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>																			
				<bitRange>[31:31]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
