cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
			</registers>
		</peripheral>
		
		
	<peripheral>
	<name>SCTIPU</name>
	<description> SCT Input Processing Unit (IPU) </description>
	<groupName>SCTIPU</groupName>
	<baseAddress>0x400B8000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<registers>
		<register>
			<name>SAMPLE_CTRL</name>
			<description>SCT IPU sample control register. Contains the input mux selects,  latch/sample-enable mux selects, and sample overrride bits for the  SAMPLE module.</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>IN0SEL</name>
					<description>Select SCT IPU input source for output channel 0.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SAMPE_IN_A0_SELECT_</name>
							<description>SAMPE_IN_A0. Select input SAMPLE_IN_A0.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SAMPE_IN_B0_SELECT_</name>
							<description>SAMPE_IN_B0. Select input SAMPLE_IN_B0.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>IN1SEL</name>
					<description>Select SCT IPU input source for output channel 1.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SAMPE_IN_A1_SELECT_</name>
							<description>SAMPE_IN_A1. Select input SAMPLE_IN_A1.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SAMPE_IN_B1_SELECT_</name>
							<description>SAMPE_IN_B1. Select input SAMPLE_IN_B1.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>IN2SEL</name>
					<description>Select SCT IPU input source for output channel 2.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SAMPE_IN_A2_SELECT_</name>
							<description>SAMPE_IN_A2. Select input SAMPLE_IN_A2.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SAMPE_IN_B2_SELECT_</name>
							<description>SAMPE_IN_B2. Select input SAMPLE_IN_B2.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>IN3SEL</name>
					<description>Select. SCT IPU input source for output channel 3.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SAMPE_IN_A3_SELECT_</name>
							<description>SAMPE_IN_A3. Select input SAMPLE_IN_A3.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SAMPE_IN_B3_SELECT_</name>
							<description>SAMPE_IN_B3. Select input SAMPLE_IN_B3.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SAMPLE_EN0SEL</name>
					<description>Select the sample enable input as the latch/sample-enable control for the Sample_Output(0)  latch. Depending on the value of the corresponding LATCHn_EN bit, this latch is transparent when the LATCHn_EN bit is 1 or latched when the LATCHn_EN bit is 0.</description>
					<bitRange>[5:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELECTS_SAMPLE_ENABL</name>
							<description>Selects Sample_Enable_A as the latch/sample-enable control for the Sample_Output(0)  latch.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_SAMPLE_ENABL</name>
							<description>Selects Sample_Enable_B as the latch/sample-enable control for the Sample_Output(0)  latch.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_SAMPLE_ENABL</name>
							<description>Selects Sample_Enable_C as the latch/sample-enable control for the Sample_Output(0)  latch.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_SAMPLE_ENABL</name>
							<description>Selects Sample_Enable_D as the latch/sample-enable control for the Sample_Output(0)  latch.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SAMPLE_EN1SEL</name>
					<description>Select the sample enable input as the latch/sample-enable control for the Sample_Output(1)  latch. Depending on the value of the corresponding LATCHn_EN bit, this latch is transparent when the LATCHn_EN bit is 1 or latched when the LATCHn_EN bit is 0.</description>
					<bitRange>[7:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELECTS_SAMPLE_ENABL</name>
							<description>Selects Sample_Enable_A as the latch/sample-enable control for the Sample_Output(1)  latch.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_SAMPLE_ENABL</name>
							<description>Selects Sample_Enable_B as the latch/sample-enable control for the Sample_Output(1)  latch.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_SAMPLE_ENABL</name>
							<description>Selects Sample_Enable_C as the latch/sample-enable control for the Sample_Output(1)  latch.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_SAMPLE_ENABL</name>
							<description>Selects Sample_Enable_D as the latch/sample-enable control for the Sample_Output(1)  latch.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SAMPLE_EN2SEL</name>
					<description>Select the sample enable input as the latch/sample-enable control for the Sample_Output(2)  latch. Depending on the value of the corresponding LATCHn_EN bit, this latch is transparent when the LATCHn_EN bit is 1 or latched when the LATCHn_EN bit is 0.</description>
					<bitRange>[9:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELECTS_SAMPLE_ENABL</name>
							<description>Selects Sample_Enable_A as the latch/sample-enable control for the Sample_Output(2)  latch.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_SAMPLE_ENABL</name>
							<description>Selects Sample_Enable_B as the latch/sample-enable control for the Sample_Output(2)  latch.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_SAMPLE_ENABL</name>
							<description>Selects Sample_Enable_C as the latch/sample-enable control for the Sample_Output(2)  latch.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_SAMPLE_ENABL</name>
							<description>Selects Sample_Enable_D as the latch/sample-enable control for the Sample_Output(2)  latch.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SAMPLE_EN3SEL</name>
					<description>Select the sample enable input as the latch/sample-enable control for the Sample_Output(3)  latch. Depending on the value of the corresponding LATCHn_EN bit, this latch is transparent when the LATCHn_EN bit is 1 or latched when the LATCHn_EN bit is 0.</description>
					<bitRange>[11:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELECTS_SAMPLE_ENABL</name>
							<description>Selects Sample_Enable_A as the latch/sample-enable control for the Sample_Output(3)  latch.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_SAMPLE_ENABL</name>
							<description>Selects Sample_Enable_B as the latch/sample-enable control for the Sample_Output(3)  latch.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_SAMPLE_ENABL</name>
							<description>Selects Sample_Enable_C as the latch/sample-enable control for the Sample_Output(3)  latch.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SELECTS_SAMPLE_ENABL</name>
							<description>Selects Sample_Enable_D as the latch/sample-enable control for the Sample_Output(3)  latch.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>LATCHEN0</name>
					<description>Enable latch for output channel 0.</description>
					<bitRange>[12:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TRANSPARENT_MODE_SA</name>
							<description>Transparent mode. Sample_Output(0) latch is forced into transparent mode. The selected Sample_Input is passed directly through to Sample_Output(0). The sample-enable control line selected  for this latch has no effect.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LATCHED_MODE_THE_SA</name>
							<description>Latched mode. The Sample_Output(0) latch is operational and will sample or latch based on the state of  the selected sample-enable control signal.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>LATCHEN1</name>
					<description>Enable latch for output channel 1.</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TRANSPARENT_MODE_SA</name>
							<description>Transparent mode. Sample_Output(1) latch is forced into transparent mode. The selected Sample_Input is passed directly through to Sample_Output(1). The sample-enable control line selected  for this latch has no effect.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LATCHED_MODE_THE_SA</name>
							<description>Latched mode. The Sample_Output(1) latch is operational and will sample or latch based on the state of  the selected sample-enable control signal.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>LATCHEN2</name>
					<description>Enable latch for output channel 2.</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TRANSPARENT_MODE_SA</name>
							<description>Transparent mode. Sample_Output(2) latch is forced into transparent mode. The selected Sample_Input is passed directly through to Sample_Output(2). The sample-enable control line selected  for this latch has no effect.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LATCHED_MODE_THE_SA</name>
							<description>Latched mode. The Sample_Output(2) latch is operational and will sample or latch based on the state of  the selected sample-enable control signal.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>LATCHEN3</name>
					<description>Enable latch for output channel 3.</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TRANSPARENT_MODE_SA</name>
							<description>Transparent mode. Sample_Output(3) latch is forced into transparent mode. The selected Sample_Input is passed directly through to Sample_Output(3). The sample-enable control line selected  for this latch has no effect.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LATCHED_MODE_THE_SA</name>
							<description>Latched mode. The Sample_Output(3) latch is operational and will sample or latch based on the state of  the selected sample-enable control signal.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
			</fields>
		</register>
		<register>
			<dim>4</dim>
			<dimIncrement>0x20</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>ABORT_ENABLE%s</name>
			<description>SCT IPU abort enable  register: Selects which input source  contributes to ORed Abort Output 0.</description>
			<addressOffset>0x020</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ENA0</name>
					<description>Enable abort source SCT_ABORT0.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_</name>
							<description>Enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ENA1</name>
					<description>Enable abort source SCT_ABORT1.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_</name>
							<description>Enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ENA2</name>
					<description>Enable abort source ACMP0 output.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_</name>
							<description>Enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ENA3</name>
					<description>Enable abort source ACMP1 output.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_</name>
							<description>Enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ENA4</name>
					<description>Enable abort source ACMP2 output.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_</name>
							<description>Enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ENA5</name>
					<description>Enable abort source ACMP3 output.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_</name>
							<description>Enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ENA6</name>
					<description>Enable abort source SCT0_OUT9.</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_</name>
							<description>Enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ENA7</name>
					<description>Enable abort source ADC0_THCMP_IRQ.</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_</name>
							<description>Enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ENA8</name>
					<description>Enable abort source ADC1_THCMP_IRQ.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_</name>
							<description>Enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
			</fields>
		</register>
		<register>
			<dim>4</dim>
			<dimIncrement>0x20</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>ABORT_SOURCE%s</name>
			<description>SCT IPU abort source  register: Status register indicating which input source caused abort output 0.</description>
			<addressOffset>0x024</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ACT0</name>
					<description>Source SCT_ABORT0 activated. This bit is set by hardware when the source is actived. Write 0 to clear. This function can be assigned to any pin via the PINASSIGN10 register in the switch matrix.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_ACTIVATED_</name>
							<description>Not activated.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACTIVATED_</name>
							<description>Activated.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACT1</name>
					<description>Source SCT_ABORT1 activated. This bit is set by hardware when the source is actived. Write 0 to clear. This function can be assigned to any pin via the PINASSIGN10 register in the switch matrix.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_ACTIVATED_</name>
							<description>Not activated.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACTIVATED_</name>
							<description>Activated.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACT2</name>
					<description>Source ACMP0 output activated. This bit is set by hardware when the source is actived. Write 0 to clear.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_ACTIVATED_</name>
							<description>Not activated.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACTIVATED_</name>
							<description>Activated.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACT3</name>
					<description>Source ACMP1 output activated. This bit is set by hardware when the source is actived. Write 0 to clear.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_ACTIVATED_</name>
							<description>Not activated.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACTIVATED_</name>
							<description>Activated.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACT4</name>
					<description>Source ACMP2 output activated. This bit is set by hardware when the source is actived. Write 0 to clear.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_ACTIVATED_</name>
							<description>Not activated.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACTIVATED_</name>
							<description>Activated.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACT5</name>
					<description>Source ACMP3 output activated. This bit is set by hardware when the source is actived. Write 0 to clear.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_ACTIVATED_</name>
							<description>Not activated.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACTIVATED_</name>
							<description>Activated.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACT6</name>
					<description>Source SCT0_OUT9 activated. This bit is set by hardware when the source is actived. Write 0 to clear.</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_ACTIVATED_</name>
							<description>Not activated.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACTIVATED_</name>
							<description>Activated.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACT7</name>
					<description>Source ADC0_THCMP_IRQ activated. This bit is set by hardware when the source is actived. Write 0 to clear.</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_ACTIVATED_</name>
							<description>Not activated.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACTIVATED_</name>
							<description>Activated.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACT8</name>
					<description>Source ADC1_THCMP_IRQ activated. This bit is set by hardware when the source is actived. Write 0 to clear.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_ACTIVATED_</name>
							<description>Not activated.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACTIVATED_</name>
							<description>Activated.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
			</fields>
		</register>
