cmsis-svd/cmsis-svd/data/NXP/LPC15xx_v0.7.svd
	</registers>
	</peripheral>
		
		<peripheral>
			<name>FLASHCTRL</name>
			<description>Flash controller </description>
			<groupName>FLASHCTRL</groupName>
			<baseAddress>0x400BC000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>FLASH</name>
				<value>2</value>
			</interrupt>
			<interrupt>
				<name>EE</name>
				<value>3</value>
			</interrupt>
			<registers>
				<register>
					<name>FMSSTART</name>
					<description>Signature start address register</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>START</name>
							<description>Signature generation start address (corresponds to AHB byte address bits[20:4]).</description>
							<bitRange>[16:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:17]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FMSSTOP</name>
					<description>Signature stop-address register</description>
					<addressOffset>0x024</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STOPA</name>
							<description>Stop address for signature generation (the word specified by STOPA is included in the address range). The address is in units of memory words, not bytes.</description>
							<bitRange>[16:0]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[30:17]</bitRange>
							
						</field>
						<field>
							<name>STRTBIST</name>
							<description>When this bit is written to 1, signature generation starts. At the end of signature generation, this bit is automatically cleared.</description>
							<bitRange>[31:31]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>FMSW0</name>
					<description>Signature word</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SIG</name>
							<description>32-bit signature.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		
	
		<peripheral derivedFrom="USART0">
			<name>USART2</name>
			<description>USART2</description>
			<baseAddress>0x400C0000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART2</name>
				<value>23</value>
			</interrupt>
			
		</peripheral>	
		<peripheral>
	<name>C_CAN0</name>
	<description>Controller Area Network C_CAN0 </description>
	<groupName>C_CAN0</groupName>
	<baseAddress>0x400F0000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>C_CAN0</name>
	<value>27</value>
	</interrupt>
	<registers>
		<register>
			<name>CNTL</name>
			<description>CAN control</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x0001</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INIT</name>
					<description>Initialization</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NORMAL_OPERATION</name>
							<description>Normal operation.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STARTED</name>
							<description>Started. Initialization is started. On reset, software needs to initialize the CAN controller.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>IE</name>
					<description>Module interrupt enable</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_CAN_INTERRUP</name>
							<description>Disable CAN interrupts. The interrupt line is always HIGH.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_CAN_INTERRUPT</name>
							<description>Enable CAN interrupts. The interrupt line is set to LOW and remains LOW until all pending interrupts are cleared.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SIE</name>
					<description>Status change interrupt enable</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_STATUS_CHANG</name>
							<description>Disable status change interrupts. No status change interrupt will be generated.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_STATUS_CHANGE</name>
							<description>Enable status change interrupts. A status change interrupt will be generated when a message transfer is successfully completed or a CAN bus error is detected.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EIE</name>
					<description>Error interrupt enable</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_ERROR_INTERR</name>
							<description>Disable error interrupt. No error status interrupt will be generated.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_ERROR_INTERRU</name>
							<description>Enable error interrupt. A change in the bits BOFF or EWARN in the CANSTAT registers will generate an interrupt.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>reserved</description>
					<bitRange>[4:4]</bitRange>

